## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be created
  + resource "aws_api_gateway_account" "api_cloudwatch" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-09-29T13:04:37Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:507252742351:s50ry4jhg5/" -> (known after apply)
      ~ id                = "r6227i" -> (known after apply)
      ~ invoke_url        = "https://s50ry4jhg5.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "184bb32db09bf3e30a4dcdba90036184" -> "dd025968359515dc1a9a4396aa59232f" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "s50ry4jhg5"
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
      ~ deployment_id         = "r6227i" -> (known after apply)
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.api_access will be created
  + resource "aws_cloudwatch_log_group" "api_access" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api-gateway/api-access"
      + retention_in_days = 14
      + tags              = {
          + "CostCenter" = "scan-websites-production"
        }
      + tags_all          = {
          + "CostCenter" = "scan-websites-production"
        }
    }

  # aws_iam_role.api_cloudwatch will be created
  + resource "aws_iam_role" "api_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ApiGatewayCloudWatchRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.api_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "api_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "ApiGatewayCloudWatchRole"
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>